backend_iluvmovie/app/controllers/favorites_controller.rb

  def index
    @favorites = Favorite.all
---
SELECT "favorites".* FROM "favorites"