backend_iluvmovie/app/controllers/users_controller.rb

  def create
    @user = User.new(new_user_params)

    if @user.valid?
      @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "asa"], ["password_digest", "$2a$12$av9I58JBbBoskVKJEImX2.uxxA63oQoTGpUwzshte/Koa.Q.qSb7a"], ["created_at", "2019-09-26 19:46:32.251838"], ["updated_at", "2019-09-26 19:46:32.251838"]]